RT-Thread/rt-thread/bsp/stm32/libraries/HAL_Drivers/drv_spi.c
    if (HAL_SPI_Init(spi_handle) != HAL_OK)
    {
        return RT_EIO;
    }

#if defined(SOC_SERIES_STM32L4) || defined(SOC_SERIES_STM32F0) \
        || defined(SOC_SERIES_STM32F7) || defined(SOC_SERIES_STM32G0) || defined(SOC_SERIES_STM32WB)
    SET_BIT(spi_handle->Instance->CR2, SPI_RXFIFO_THRESHOLD_HF);
#endif

    /* DMA configuration */
    if (spi_drv->spi_dma_flag & SPI_USING_RX_DMA_FLAG)
    {
        HAL_DMA_Init(&spi_drv->dma.handle_rx);

        __HAL_LINKDMA(&spi_drv->handle, hdmarx, spi_drv->dma.handle_rx);

        /* NVIC configuration for DMA transfer complete interrupt */
        HAL_NVIC_SetPriority(spi_drv->config->dma_rx->dma_irq, 0, 0);
        HAL_NVIC_EnableIRQ(spi_drv->config->dma_rx->dma_irq);
    }

    if (spi_drv->spi_dma_flag & SPI_USING_TX_DMA_FLAG)
    {
        HAL_DMA_Init(&spi_drv->dma.handle_tx);

        __HAL_LINKDMA(&spi_drv->handle, hdmatx, spi_drv->dma.handle_tx);

        /* NVIC configuration for DMA transfer complete interrupt */
        HAL_NVIC_SetPriority(spi_drv->config->dma_tx->dma_irq, 0, 1);
        HAL_NVIC_EnableIRQ(spi_drv->config->dma_tx->dma_irq);
    }

    if (spi_drv->spi_dma_flag & SPI_USING_TX_DMA_FLAG || spi_drv->spi_dma_flag & SPI_USING_RX_DMA_FLAG)
    {
        HAL_NVIC_SetPriority(spi_drv->config->irq_type, 2, 0);
        HAL_NVIC_EnableIRQ(spi_drv->config->irq_type);
    }

    LOG_D("%s init done", spi_drv->config->bus_name);
    return RT_EOK;
}

/**
  * @brief  set spi wait enent
  * @param  spi        --  stm32_spi
  *         tx_rx_type --  SPI_TX / SPI_RX / SPI_TxRx
  * @retval None
  */
static void set_wait_event(struct stm32_spi *spi, enum T_R_TYPE tx_rx_type)
{
    SPI_HandleTypeDef *hspi = &spi->handle;
    switch ((int)(hspi->Instance))
    {
#ifdef BSP_USING_SPI1
    case (int)SPI1:
    {
        switch (tx_rx_type)
        {
        case SPI_TX:
            spi->wait_event = SPI1_TxCplt_EVENT;
            break;
        case SPI_RX:
            spi->wait_event = SPI1_RxCplt_EVENT;
            break;
        case SPI_TxRx:
            spi->wait_event = SPI1_TxRxCplt_EVENT;
            break;
        default:
            break;
        }
    }
    break;
#endif
#ifdef BSP_USING_SPI2
    case (int)SPI2:
    {
        switch (tx_rx_type)
        {
        case SPI_TX:
            spi->wait_event = SPI2_TxCplt_EVENT;
            break;
        case SPI_RX:
            spi->wait_event = SPI2_RxCplt_EVENT;
            break;
        case SPI_TxRx:
            spi->wait_event = SPI2_TxRxCplt_EVENT;
            break;
        default:
            break;
        }
    }
    break;
#endif
#ifdef BSP_USING_SPI3
    case (int)SPI3:
    {
        switch (tx_rx_type)
        {
        case SPI_TX:
            spi->wait_event = SPI3_TxCplt_EVENT;
            break;
        case SPI_RX:
            spi->wait_event = SPI3_RxCplt_EVENT;
            break;
        case SPI_TxRx:
            spi->wait_event = SPI3_TxRxCplt_EVENT;
            break;
        default:
            break;
        }
    }
    break;
#endif
#ifdef BSP_USING_SPI4
    case (int)SPI4:
    {
        switch (tx_rx_type)
        {
        case SPI_TX:
            spi->wait_event = SPI4_TxCplt_EVENT;
            break;
        case SPI_RX:
            spi->wait_event = SPI4_RxCplt_EVENT;
            break;
        case SPI_TxRx:
            spi->wait_event = SPI4_TxRxCplt_EVENT;
            break;
        default:
            break;
        }
    }
    break;
#endif
#ifdef BSP_USING_SPI5
    case (int)SPI5:
    {
        switch (tx_rx_type)
        {
        case SPI_TX:
            spi->wait_event = SPI5_TxCplt_EVENT;
            break;
        case SPI_RX:
            spi->wait_event = SPI5_RxCplt_EVENT;
            break;
        case SPI_TxRx:
            spi->wait_event = SPI5_TxRxCplt_EVENT;
            break;
        default:
            break;
        }
    }
    break;
#endif
#ifdef BSP_USING_SPI6
    case (int)SPI6:
    {
        switch (tx_rx_type)
        {
        case SPI_TX:
            spi->wait_event = SPI6_TxCplt_EVENT;
            break;
        case SPI_RX:
            spi->wait_event = SPI6_RxCplt_EVENT;
            break;
        case SPI_TxRx:
            spi->wait_event = SPI6_TxRxCplt_EVENT;
            break;
        default:
            break;
        }
    }
    break;
#endif
    default:
        break;
    }
}

/**
  * @brief  wait spi transfer completed.
  * @param  spi  stm32_spi
  * @retval None
  */
static void rthw_spi_wait_completed(struct stm32_spi *spi)
{
    rt_uint32_t e;
    if (rt_event_recv(&spi_event, (spi->wait_event),
                      RT_EVENT_FLAG_OR | RT_EVENT_FLAG_CLEAR,
                      RT_WAITING_FOREVER, &e) == RT_EOK)
    {
        return;
    }
}

static rt_uint32_t spixfer(struct rt_spi_device *device, struct rt_spi_message *message)
{
    HAL_StatusTypeDef state;
    rt_size_t message_length, already_send_length;
    rt_uint16_t send_length;
    rt_uint8_t *recv_buf;
    const rt_uint8_t *send_buf;

    RT_ASSERT(device != RT_NULL);
    RT_ASSERT(device->bus != RT_NULL);
    RT_ASSERT(device->bus->parent.user_data != RT_NULL);
    RT_ASSERT(message != RT_NULL);

    struct stm32_spi *spi_drv =  rt_container_of(device->bus, struct stm32_spi, spi_bus);
    SPI_HandleTypeDef *spi_handle = &spi_drv->handle;
    struct stm32_hw_spi_cs *cs = device->parent.user_data;

    if (message->cs_take && !(device->config.mode & RT_SPI_NO_CS))
    {
        if (device->config.mode & RT_SPI_CS_HIGH)
            HAL_GPIO_WritePin(cs->GPIOx, cs->GPIO_Pin, GPIO_PIN_SET);
        else
            HAL_GPIO_WritePin(cs->GPIOx, cs->GPIO_Pin, GPIO_PIN_RESET);
    }

    LOG_D("%s transfer prepare and start", spi_drv->config->bus_name);
    LOG_D("%s sendbuf: %X, recvbuf: %X, length: %d",
          spi_drv->config->bus_name,
          (uint32_t)message->send_buf,
          (uint32_t)message->recv_buf, message->length);

    message_length = message->length;
    recv_buf = message->recv_buf;
    send_buf = message->send_buf;
    while (message_length)
    {
        /* the HAL library use uint16 to save the data length */
        if (message_length > 65535)
        {
            send_length = 65535;
            message_length = message_length - 65535;
        }
        else
        {
            send_length = message_length;
            message_length = 0;
        }

        /* calculate the start address */
        already_send_length = message->length - send_length - message_length;
        send_buf = (rt_uint8_t *)message->send_buf + already_send_length;
        recv_buf = (rt_uint8_t *)message->recv_buf + already_send_length;

        /* start once data exchange in DMA mode */
        if (message->send_buf && message->recv_buf)
        {
            if ((spi_drv->spi_dma_flag & SPI_USING_TX_DMA_FLAG) && (spi_drv->spi_dma_flag & SPI_USING_RX_DMA_FLAG))
            {
                set_wait_event(spi_drv, SPI_TxRx);
                state = HAL_SPI_TransmitReceive_DMA(spi_handle, (uint8_t *)send_buf, (uint8_t *)recv_buf, send_length);
            }
            else
            {
                state = HAL_SPI_TransmitReceive(spi_handle, (uint8_t *)send_buf, (uint8_t *)recv_buf, send_length, 1000);
            }
        }
        else if (message->send_buf)
        {
            if (spi_drv->spi_dma_flag & SPI_USING_TX_DMA_FLAG)
            {
                set_wait_event(spi_drv, SPI_TX);
                state = HAL_SPI_Transmit_DMA(spi_handle, (uint8_t *)send_buf, send_length);
            }
            else
            {
                state = HAL_SPI_Transmit(spi_handle, (uint8_t *)send_buf, send_length, 1000);
            }

            if (message->cs_release && (device->config.mode & RT_SPI_3WIRE))
            {
                /* release the CS by disable SPI when using 3 wires SPI */
                __HAL_SPI_DISABLE(spi_handle);
            }
        }
        else
        {
            memset((uint8_t *)recv_buf, 0xff, send_length);
            if (spi_drv->spi_dma_flag & SPI_USING_RX_DMA_FLAG)
            {
                set_wait_event(spi_drv, SPI_RX);
                state = HAL_SPI_Receive_DMA(spi_handle, (uint8_t *)recv_buf, send_length);
            }
            else
            {
                /* clear the old error flag */
                __HAL_SPI_CLEAR_OVRFLAG(spi_handle);
                state = HAL_SPI_Receive(spi_handle, (uint8_t *)recv_buf, send_length, 1000);
            }
        }

