RT-Thread/rt-thread/bsp/stm32/libraries/HAL_Drivers/drv_spi.c
#ifdef BSP_SPI3_RX_USING_DMA
    spi_bus_obj[SPI3_INDEX].spi_dma_flag |= SPI_USING_RX_DMA_FLAG;
    static struct dma_config spi3_dma_rx = SPI3_RX_DMA_CONFIG;
    spi_config[SPI3_INDEX].dma_rx = &spi3_dma_rx;
#endif
#ifdef BSP_SPI3_TX_USING_DMA
    spi_bus_obj[SPI3_INDEX].spi_dma_flag |= SPI_USING_TX_DMA_FLAG;
    static struct dma_config spi3_dma_tx = SPI3_TX_DMA_CONFIG;
    spi_config[SPI3_INDEX].dma_tx = &spi3_dma_tx;
#endif

#ifdef BSP_SPI4_RX_USING_DMA
    spi_bus_obj[SPI4_INDEX].spi_dma_flag |= SPI_USING_RX_DMA_FLAG;
    static struct dma_config spi4_dma_rx = SPI4_RX_DMA_CONFIG;
    spi_config[SPI4_INDEX].dma_rx = &spi4_dma_rx;
#endif
#ifdef BSP_SPI4_TX_USING_DMA
    spi_bus_obj[SPI4_INDEX].spi_dma_flag |= SPI_USING_TX_DMA_FLAG;
    static struct dma_config spi4_dma_tx = SPI4_TX_DMA_CONFIG;
    spi_config[SPI4_INDEX].dma_tx = &spi4_dma_tx;
#endif

#ifdef BSP_SPI5_RX_USING_DMA
    spi_bus_obj[SPI5_INDEX].spi_dma_flag |= SPI_USING_RX_DMA_FLAG;
    static struct dma_config spi5_dma_rx = SPI5_RX_DMA_CONFIG;
    spi_config[SPI5_INDEX].dma_rx = &spi5_dma_rx;
#endif
#ifdef BSP_SPI5_TX_USING_DMA
    spi_bus_obj[SPI5_INDEX].spi_dma_flag |= SPI_USING_TX_DMA_FLAG;
    static struct dma_config spi5_dma_tx = SPI5_TX_DMA_CONFIG;
    spi_config[SPI5_INDEX].dma_tx = &spi5_dma_tx;
#endif

#ifdef BSP_SPI6_RX_USING_DMA
    spi_bus_obj[SPI6_INDEX].spi_dma_flag |= SPI_USING_RX_DMA_FLAG;
    static struct dma_config spi6_dma_rx = SPI6_RX_DMA_CONFIG;
    spi_config[SPI6_INDEX].dma_rx = &spi6_dma_rx;
#endif
#ifdef BSP_SPI6_TX_USING_DMA
    spi_bus_obj[SPI6_INDEX].spi_dma_flag |= SPI_USING_TX_DMA_FLAG;
    static struct dma_config spi6_dma_tx = SPI6_TX_DMA_CONFIG;
    spi_config[SPI6_INDEX].dma_tx = &spi6_dma_tx;
#endif
}

#if defined(SOC_SERIES_STM32F0)
void SPI1_DMA_RX_TX_IRQHandler(void)
{
#if defined(BSP_USING_SPI1) && defined(BSP_SPI1_TX_USING_DMA)
    SPI1_DMA_TX_IRQHandler();
#endif

#if defined(BSP_USING_SPI1) && defined(BSP_SPI1_RX_USING_DMA)
    SPI1_DMA_RX_IRQHandler();
#endif
}

void SPI2_DMA_RX_TX_IRQHandler(void)
{
#if defined(BSP_USING_SPI2) && defined(BSP_SPI2_TX_USING_DMA)
    SPI2_DMA_TX_IRQHandler();
#endif

#if defined(BSP_USING_SPI2) && defined(BSP_SPI2_RX_USING_DMA)
    SPI2_DMA_RX_IRQHandler();
#endif
}
#endif  /* SOC_SERIES_STM32F0 */

void HAL_SPI_TxRxCpltCallback(SPI_HandleTypeDef *hspi)
{
    rt_uint32_t event = 0;
    switch ((int)(hspi->Instance))
    {
#ifdef BSP_USING_SPI1
    case (int)SPI1:
        event = SPI1_TxRxCplt_EVENT;
        break;
#endif
#ifdef BSP_USING_SPI2
    case (int)SPI2:
        event = SPI2_TxRxCplt_EVENT;
        break;
#endif
#ifdef BSP_USING_SPI3
    case (int)SPI3:
        event = SPI3_TxRxCplt_EVENT;
        break;
#endif
#ifdef BSP_USING_SPI4
    case (int)SPI4:
        event = SPI4_TxRxCplt_EVENT;
        break;
#endif
#ifdef BSP_USING_SPI5
    case (int)SPI5:
        event = SPI5_TxRxCplt_EVENT;
        break;
#endif
#ifdef BSP_USING_SPI6
    case (int)SPI6:
        event = SPI6_TxRxCplt_EVENT;
        break;
#endif
    default:
        break;
    }
    rt_event_send(&spi_event, event);
}

void HAL_SPI_TxCpltCallback(SPI_HandleTypeDef *hspi)
{
    rt_uint32_t event = 0;
    switch ((int)(hspi->Instance))
    {
#ifdef BSP_USING_SPI1
    case (int)SPI1:
        event = SPI1_TxCplt_EVENT;
        break;
#endif
#ifdef BSP_USING_SPI2
    case (int)SPI2:
        event = SPI2_TxCplt_EVENT;
        break;
#endif
#ifdef BSP_USING_SPI3
    case (int)SPI3:
        event = SPI3_TxCplt_EVENT;
        break;
#endif
#ifdef BSP_USING_SPI4
    case (int)SPI4:
        event = SPI4_TxCplt_EVENT;
        break;
#endif
#ifdef BSP_USING_SPI5
    case (int)SPI5:
        event = SPI5_TxCplt_EVENT;
        break;
#endif
#ifdef BSP_USING_SPI6
    case (int)SPI6:
        event = SPI6_TxCplt_EVENT;
        break;
#endif
    default:
        break;
    }
    rt_event_send(&spi_event, event);
}

void HAL_SPI_RxCpltCallback(SPI_HandleTypeDef *hspi)
{
    rt_uint32_t event = 0;
    switch ((int)(hspi->Instance))
    {
#ifdef BSP_USING_SPI1
    case (int)SPI1:
        event = SPI1_RxCplt_EVENT;
        break;
#endif
#ifdef BSP_USING_SPI2
    case (int)SPI2:
        event = SPI2_RxCplt_EVENT;
        break;
#endif
#ifdef BSP_USING_SPI3
    case (int)SPI3:
        event = SPI3_RxCplt_EVENT;
        break;
#endif
#ifdef BSP_USING_SPI4
    case (int)SPI4:
        event = SPI4_RxCplt_EVENT;
        break;
#endif
#ifdef BSP_USING_SPI5
    case (int)SPI5:
        event = SPI5_RxCplt_EVENT;
        break;
#endif
#ifdef BSP_USING_SPI6
    case (int)SPI6:
        event = SPI6_RxCplt_EVENT;
        break;
#endif
    default:
        break;
    }
    rt_event_send(&spi_event, event);
}

int rt_hw_spi_init(void)
{
    stm32_get_dma_info();
    return rt_hw_spi_bus_init();
}
INIT_BOARD_EXPORT(rt_hw_spi_init);

#endif /* BSP_USING_SPI1 || BSP_USING_SPI2 || BSP_USING_SPI3 || BSP_USING_SPI4 || BSP_USING_SPI5 */
#endif /* RT_USING_SPI */
